[
{
    "_id":"lsdllu328432432ju434",
    "isActive" : true,
    "isDeleted" : false,
    "name":"Organic Chemistry",
    "subject" : {
    "_id":"this23jsldslfjsorewf",
    "isActive":true,
    "isDeleted":false,
    "name":"Chemistry",
    "syllabus":"NECTA",
    "createdAt":"2024-03-17 15:08:06.392933",
    "updatedAt":"2024-03-17 15:08:06.392933",
    "__v":1
},
    "level" : {
    "_id":"this234j4343fdjsd4343",
    "isActive":true,
    "isDeleted":false,
    "name":"Form Five",
    "syllabus":"NECTA",
    "createdAt":"2024-03-17 15:08:06.392933",
    "updatedAt":"2024-03-17 15:08:06.392933",
    "__v":1
},
    "syllabus" : "NECTA",
    "isFeatured":false,
    "coverImageUrl":"https://learnt.io/blog/content/images/2023/10/Organic-Chemistry.jpg",
    "descriptions" : "Organic chemistry is a branch of chemistry that focuses on the study of carbon-based compounds, which are essential building blocks of life. In this field, chemists investigate the structure, properties, composition, and reactions of organic molecules, ranging from simple hydrocarbons to complex biomolecules found in living organisms. Organic chemistry plays a vital role in various scientific disciplines, including medicine, pharmacology, biochemistry, agriculture, and materials science, offering insights into the synthesis, manipulation, and understanding of organic compounds. Through the exploration of organic chemistry, researchers aim to unravel the mysteries of molecular structure and function, paving the way for advancements in drug development, sustainable technologies, and environmental conservation.At its core, organic chemistry seeks to unravel the intricate relationships between molecular structure and chemical behavior, providing a framework for understanding the complex world of carbon-based compounds. By studying the mechanisms of organic reactions, the diversity of functional groups, and the principles of organic synthesis, scientists gain valuable insights into the molecular processes underlying biological systems and chemical transformations. Organic chemistry serves as a cornerstone of modern science, driving innovation and discovery across a wide range of disciplines and offering profound implications for human health, technological advancement, and the sustainable utilization of natural resources.",
    "chapters":[
    	{
    		"_id":"lsdfjou435ewrr",
    		"name":"The chemical Bond",
    		"topic":"lsdllu328432432ju434",
    		"chapterNo":"1",
    		"content":"The atomic theory of electrons began in the early 1900s and gained acceptance around 1926 after Heisenberg and Schroedinger found mathematical solutions to the electronic energy levels found in atoms, the field is now called quantum mechanics. Electrons exist in energy levels that surround the nucleus of the atom. The energy of these levels increases as they get farther from the nucleus. The energy levels are called shells, and within these shells are other energy levels, called subshells or orbitals., that contain up to two electrons. The calculations from atomic theory give the following results for electron energy and orbitals. The results for the first two energy levels (shells 1 and 2) are the most important for bonding in organic chemistry."
    	},
    	    	{
    		"_id":"lsdfjou43d4sde",
    		"name":"Bonding in Carbon Compounds",
    		"topic":"lsdllu328432432ju434",
    		"chapterNo":"2",
    		"content":"The property of carbon that makes it unique is its ability to form bonds with itself and therefore allows a large number of organic chemicals with many diverse properties. Carbon has the property of forming single, double and triple bonds with itself and with other atoms. This multiple bond ability allows carbon compounds to have a variety of shapes. In all carbon compounds, carbon forms four bonds. The types of bonds used by the carbon atom are known as sigma ( ) and pi ( ) bonds. Different combinations of these bonds lead to carbon single bonds, double bonds and triple bonds."
    	}
    ],
    "createdAt":"2024-03-17 15:08:06.392933",
    "updatedAt":"2024-03-17 15:08:06.392933",
  "__v":1
}

]
